app/views/listings/show.html.haml

.col-xs-12
  - @listing.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."listing_id" = $1  [["listing_id", 15]]