app/controllers/account/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "listing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "azerty"], ["user_id", 1], ["listing_id", 15], ["created_at", 2016-11-21 11:49:15 UTC], ["updated_at", 2016-11-21 11:49:15 UTC]]
---
  def create
    @comment = Comment.create(
      user_id: current_user.id,
      content: params[:comment][:content],
      listing_id: params[:comment][:listing_id]
    )