app/controllers/account/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    @user = User.find(current_user.try(:id))

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = $1, "reset_password_sent_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["encrypted_password", "$2a$11$A8v2/7ARe8EMn56A.M.wkOisFiU7lQIpyD7lYvSstSZ1TAhA54L0q"], ["reset_password_sent_at", nil], ["updated_at", 2016-11-20 22:13:34 UTC], ["id", 2]]
---
  def update
    @user = User.find(current_user.try(:id))
      if user_params.has_key?(:email)
        if @user.update_attributes(user_params)