app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE (category_id = '2')
---
  def index
    @listings = Listing.search(params)

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @listing = Listing.find(params[:id])

INSERT INTO "listings" ("title", "picture", "description", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "pd"], ["picture", "product_logo_64.png"], ["description", "pd"], ["category_id", 3], ["user_id", 2], ["created_at", 2016-11-20 16:38:42 UTC], ["updated_at", 2016-11-20 16:38:42 UTC]]
---
  def create
    @listing = Listing.create(task_params)